Revit 2018 API
Document.AcquireCoordinates Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public void AcquireCoordinates(
	ElementId linkInstanceId
)
Visual Basic
Public Sub AcquireCoordinates ( _
	linkInstanceId As ElementId _
)
Visual C++
public:
void AcquireCoordinates(
	ElementId^ linkInstanceId
)
Parameters
linkInstanceId
Type: Autodesk.Revit.DB.ElementId
See Also
Document Class
Autodesk.Revit.DB Namespace